{"config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "trainable": true, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 32, "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "kernel_size": [5, 5], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "name": "conv2d_2", "trainable": true, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 16, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 130, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 50, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 27, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential"}