{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "filters": 32, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "use_bias": true, "activation": "relu", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "filters": 16, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_1", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 130, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"units": 50, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"units": 27, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "name": "dense_3", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true}}]}